### FSMF Initialization
#### Links
https://aviadshamriz.medium.com/part-1-fs-minifilter-hooking-7e743b042a9d
https://docs.microsoft.com/en-us/archive/blogs/alexcarp/
https://fsfilters.blogspot.com/2010/02/filter-manager-concepts-part-1.html

#### 1. Fltmgr Registration
```
6: kd> bp FLTMGR!FltpSetCallbacksForInstance
6: kd> g
Breakpoint 0 hit
FLTMGR!FltpSetCallbacksForInstance:
fffff802`bfb9b1b8 48895c2408      mov     qword ptr [rsp+8],rbx
5: kd> k
 # Child-SP          RetAddr               Call Site
00 ffff9282`473725e8 fffff802`bfbd0d2f     FLTMGR!FltpSetCallbacksForInstance
01 ffff9282`473725f0 fffff802`bfbd1e98     FLTMGR!FltpInitInstance+0x3c7
02 ffff9282`473726b0 fffff802`bfbd2165     FLTMGR!FltpCreateInstanceFromName+0x1c4
03 ffff9282`47372790 fffff802`bfbdd4bc     FLTMGR!FltpEnumerateRegistryInstances+0x15d
04 ffff9282`47372830 fffff802`bfbdd39c     FLTMGR!FltpDoVolumeNotificationForNewFilter+0xe0
05 ffff9282`47372890 fffff802`c17b10fa     FLTMGR!FltStartFiltering+0x2c
06 ffff9282`473728e0 fffff802`c17b5020     DemoMinifilter!DriverEntry+0x5a 
07 ffff9282`47372920 fffff801`5d0724dd     DemoMinifilter!GsDriverEntry+0x20 
08 ffff9282`47372950 fffff801`5d07080a     nt!IopLoadDriver+0x4bd
09 ffff9282`47372b30 fffff801`5cac11ea     nt!IopLoadUnloadDriver+0x4a
0a ffff9282`47372b70 fffff801`5ca93bc5     nt!ExpWorkerThread+0x16a
0b ffff9282`47372c10 fffff801`5cbc7a3c     nt!PspSystemThreadStartup+0x55
0c ffff9282`47372c60 00000000`00000000     nt!KiStartSystemThread+0x1c
```

Breaking when loading the driver at FltpSetCallbacksForInstance, we see that RCX = FLT_FILTER for our filter object.

We then see that RDX (arg2) is the UNICODE_STRING for our MF Altitude.

```
6: kd> dt FLTMGR!_FLT_FILTER @rcx
   +0x000 Base             : _FLT_OBJECT
   +0x030 Frame            : (null) 
   +0x038 Name             : _UNICODE_STRING "DemoMinifilter"
   +0x048 DefaultAltitude  : _UNICODE_STRING "25000"
   +0x058 Flags            : 0 (No matching name)
   +0x060 DriverObject     : 0xffff828a`95c4f6b0 _DRIVER_OBJECT
   +0x068 InstanceList     : _FLT_RESOURCE_LIST_HEAD
   +0x0e8 VerifierExtension : (null) 
   +0x0f0 VerifiedFiltersLink : _LIST_ENTRY [ 0x00000000`00000000 - 0x00000000`00000000 ]
   +0x100 FilterUnload     : 0xfffff805`5b161080     long  DemoMinifilter!FsFilterUnload+0
   +0x108 InstanceSetup    : (null) 
   +0x110 InstanceQueryTeardown : (null) 
   +0x118 InstanceTeardownStart : (null) 
   +0x120 InstanceTeardownComplete : (null) 
   +0x128 SupportedContextsListHead : (null) 
   +0x130 SupportedContexts : [7] (null) 
   +0x168 PreVolumeMount   : (null) 
   +0x170 PostVolumeMount  : (null) 
   +0x178 GenerateFileName : (null) 
   +0x180 NormalizeNameComponent : (null) 
   +0x188 NormalizeNameComponentEx : (null) 
   +0x190 NormalizeContextCleanup : (null) 
   +0x198 KtmNotification  : (null) 
   +0x1a0 SectionNotification : (null) 
   +0x1a8 Operations       : 0xffff828a`9589d910 _FLT_OPERATION_REGISTRATION
   +0x1b0 OldDriverUnload  : (null) 
   +0x1b8 ActiveOpens      : _FLT_MUTEX_LIST_HEAD
   +0x208 ConnectionList   : _FLT_MUTEX_LIST_HEAD
   +0x258 PortList         : _FLT_MUTEX_LIST_HEAD
   +0x2a8 PortLock         : _EX_PUSH_LOCK
```

This returns an integer of the frame number.
A call is then made to FltpLinkFilterIntoFrame.

So the "recipe" to find the first element is:
```C
	FLTP_FRAME FilterList = FLTMGR.FltGlobals + 0xc0;
	FilterFrameHead = *(PVOID*)FilterList;
	
	/*
		7: kd> ? poi(FLTMGR!FltGlobals+0xc8)-8
		Evaluate expression: -137943351205856 = ffff828a`8f8d6020
		7: kd> dt FLTMGR!_FLTP_FRAME poi(FLTMGR!FltGlobals+0xc8)-8
		   +0x000 Type             : _FLT_TYPE
		   +0x008 Links            : _LIST_ENTRY [ 0xfffff80e`47afa600 - 0xfffff80e`47afa600 ]
		   +0x018 FrameID          : 0
		   +0x020 AltitudeIntervalLow : _UNICODE_STRING "0"
		   +0x030 AltitudeIntervalHigh : _UNICODE_STRING "409500"
		   +0x040 LargeIrpCtrlStackSize : 0x6 ''
		   +0x041 SmallIrpCtrlStackSize : 0x1 ''
		   +0x048 RegisteredFilters : _FLT_RESOURCE_LIST_HEAD
		   +0x0c8 AttachedVolumes  : _FLT_RESOURCE_LIST_HEAD
		   +0x148 MountingVolumes  : _LIST_ENTRY [ 0xffff828a`8f8d6168 - 0xffff828a`8f8d6168 ]
		   +0x158 AttachedFileSystems : _FLT_MUTEX_LIST_HEAD
		   +0x1a8 ZombiedFltObjectContexts : _FLT_MUTEX_LIST_HEAD
		   +0x1f8 KtmResourceManagerHandle : 0xffffffff`80000280 Void
		   +0x200 KtmResourceManager : 0xffff828a`9057f050 _KRESOURCEMANAGER
		   +0x208 FilterUnloadLock : _ERESOURCE
		   +0x270 DeviceObjectAttachLock : _FAST_MUTEX
		   +0x2a8 Prcb             : 0xffff828a`8f9bd700 _FLT_PRCB
		   +0x2b0 PrcbPoolToFree   : 0xffff828a`8f9bd700 Void
		   +0x2b8 LookasidePoolToFree : 0xffff828a`9057d010 Void
		   +0x2c0 IrpCtrlStackProfiler : _FLTP_IRPCTRL_STACK_PROFILER
		   +0x400 SmallIrpCtrlLookasideList : _NPAGED_LOOKASIDE_LIST
		   +0x480 LargeIrpCtrlLookasideList : _NPAGED_LOOKASIDE_LIST
		   +0x500 ReserveIrpCtrls  : _RESERVE_IRPCTRL
	*/

```

```
7: kd> dt FLTMGR!_FLTP_FRAME poi(FLTMGR!FltGlobals+0xc8)-8
   +0x000 Type             : _FLT_TYPE
   +0x008 Links            : _LIST_ENTRY [ 0xfffff80e`47afa600 - 0xfffff80e`47afa600 ]
   +0x018 FrameID          : 0
   +0x020 AltitudeIntervalLow : _UNICODE_STRING "0"
   +0x030 AltitudeIntervalHigh : _UNICODE_STRING "409500"
   +0x040 LargeIrpCtrlStackSize : 0x6 ''
   +0x041 SmallIrpCtrlStackSize : 0x1 ''
   +0x048 RegisteredFilters : _FLT_RESOURCE_LIST_HEAD
   +0x0c8 AttachedVolumes  : _FLT_RESOURCE_LIST_HEAD
   +0x148 MountingVolumes  : _LIST_ENTRY [ 0xffff828a`8f8d6168 - 0xffff828a`8f8d6168 ]
   +0x158 AttachedFileSystems : _FLT_MUTEX_LIST_HEAD
   +0x1a8 ZombiedFltObjectContexts : _FLT_MUTEX_LIST_HEAD
   +0x1f8 KtmResourceManagerHandle : 0xffffffff`80000280 Void
   +0x200 KtmResourceManager : 0xffff828a`9057f050 _KRESOURCEMANAGER
   +0x208 FilterUnloadLock : _ERESOURCE
   +0x270 DeviceObjectAttachLock : _FAST_MUTEX
   +0x2a8 Prcb             : 0xffff828a`8f9bd700 _FLT_PRCB
   +0x2b0 PrcbPoolToFree   : 0xffff828a`8f9bd700 Void
   +0x2b8 LookasidePoolToFree : 0xffff828a`9057d010 Void
   +0x2c0 IrpCtrlStackProfiler : _FLTP_IRPCTRL_STACK_PROFILER
   +0x400 SmallIrpCtrlLookasideList : _NPAGED_LOOKASIDE_LIST
   +0x480 LargeIrpCtrlLookasideList : _NPAGED_LOOKASIDE_LIST
   +0x500 ReserveIrpCtrls  : _RESERVE_IRPCTRL
7: kd> g
```

Once the frame is found which describes the altitudes the loading minifilter has, a call is then made to FltpLinkFilterIntoFrame:

```
3: kd> !object @rcx
Object: ffff828a99cf4660  Type: (ffff828a8f9f9f00) FilterConnectionPort
    ObjectHeader: ffff828a99cf4630 (new version)
    HandleCount: 0  PointerCount: 0
3: kd> dt FLTMGR!_FLT_FILTER @rcx
   +0x000 Base             : _FLT_OBJECT
   +0x030 Frame            : 0xffff828a`8f8d6020 _FLTP_FRAME
   +0x038 Name             : _UNICODE_STRING "DemoMinifilter"
   +0x048 DefaultAltitude  : _UNICODE_STRING "25000"
   +0x058 Flags            : 0 (No matching name)
   +0x060 DriverObject     : 0xffff828a`9fded2e0 _DRIVER_OBJECT
   +0x068 InstanceList     : _FLT_RESOURCE_LIST_HEAD
   +0x0e8 VerifierExtension : (null) 
   +0x0f0 VerifiedFiltersLink : _LIST_ENTRY [ 0x00000000`00000000 - 0x00000000`00000000 ]
   +0x100 FilterUnload     : 0xfffff805`5b251080     long  DemoMinifilter!FsFilterUnload+0
   +0x108 InstanceSetup    : (null) 
   +0x110 InstanceQueryTeardown : (null) 
   +0x118 InstanceTeardownStart : (null) 
   +0x120 InstanceTeardownComplete : (null) 
   +0x128 SupportedContextsListHead : (null) 
   +0x130 SupportedContexts : [7] (null) 
   +0x168 PreVolumeMount   : (null) 
   +0x170 PostVolumeMount  : (null) 
   +0x178 GenerateFileName : (null) 
   +0x180 NormalizeNameComponent : (null) 
   +0x188 NormalizeNameComponentEx : (null) 
   +0x190 NormalizeContextCleanup : (null) 
   +0x198 KtmNotification  : (null) 
   +0x1a0 SectionNotification : (null) 
   +0x1a8 Operations       : 0xffff828a`99cf4910 _FLT_OPERATION_REGISTRATION
   +0x1b0 OldDriverUnload  : (null) 
   +0x1b8 ActiveOpens      : _FLT_MUTEX_LIST_HEAD
   +0x208 ConnectionList   : _FLT_MUTEX_LIST_HEAD
   +0x258 PortList         : _FLT_MUTEX_LIST_HEAD
   +0x2a8 PortLock         : _EX_PUSH_LOCK
3: kd> k
 # Child-SP          RetAddr               Call Site
00 ffffee05`662ae7f8 fffff80e`47b1aa02     FLTMGR!FltpLinkFilterIntoFrame
01 ffffee05`662ae800 fffff805`5b2510ce     FLTMGR!FltRegisterFilter+0x4a2
02 ffffee05`662ae8e0 fffff805`5b255020     DemoMinifilter!DriverEntry+0x2e [C:\Users\Michael\Desktop\Research\MinifilterStuff\drivers\DemoMinifilter\DemoMinifilter\DemoMinifilter\DemoMinifilter.c @ 48] 
03 ffffee05`662ae920 fffff805`57a774dd     DemoMinifilter!GsDriverEntry+0x20 [minkernel\tools\gs_support\kmodefastfail\gs_driverentry.c @ 47] 
04 ffffee05`662ae950 fffff805`57a7580a     nt!IopLoadDriver+0x4bd
05 ffffee05`662aeb30 fffff805`574c61ea     nt!IopLoadUnloadDriver+0x4a
06 ffffee05`662aeb70 fffff805`57498bc5     nt!ExpWorkerThread+0x16a
07 ffffee05`662aec10 fffff805`575cca3c     nt!PspSystemThreadStartup+0x55
08 ffffee05`662aec60 00000000`00000000     nt!KiStartSystemThread+0x1c


//
//
// The FLT_FILTER object is -0x10 from the LIST_ENTRY
//
//
//




3: kd> dt FLTMGR!_FLT_FILTER 0xffff828a905819c0-0x10
   +0x000 Base             : _FLT_OBJECT
   +0x030 Frame            : 0xffff828a`8f8d6020 _FLTP_FRAME
   +0x038 Name             : _UNICODE_STRING "WdFilter"
   +0x048 DefaultAltitude  : _UNICODE_STRING "328010"
   +0x058 Flags            : 0x32 (No matching name)
   +0x060 DriverObject     : 0xffff828a`9057edb0 _DRIVER_OBJECT
   +0x068 InstanceList     : _FLT_RESOURCE_LIST_HEAD
   +0x0e8 VerifierExtension : (null) 
   +0x0f0 VerifiedFiltersLink : _LIST_ENTRY [ 0x00000000`00000000 - 0x00000000`00000000 ]
   +0x100 FilterUnload     : 0xfffff80e`48682c10     long  +0
   +0x108 InstanceSetup    : 0xfffff80e`48682f30     long  +0
   +0x110 InstanceQueryTeardown : 0xfffff80e`48683120     long  +0
   +0x118 InstanceTeardownStart : (null) 
   +0x120 InstanceTeardownComplete : 0xfffff80e`48683180     void  +0
   +0x128 SupportedContextsListHead : 0xffff828a`90584060 _ALLOCATE_CONTEXT_HEADER
   +0x130 SupportedContexts : [7] (null) 
   +0x168 PreVolumeMount   : (null) 
   +0x170 PostVolumeMount  : 0xfffff80e`486546b0     _FLT_POSTOP_CALLBACK_STATUS  +0
   +0x178 GenerateFileName : (null) 
   +0x180 NormalizeNameComponent : (null) 
   +0x188 NormalizeNameComponentEx : (null) 
   +0x190 NormalizeContextCleanup : (null) 
   +0x198 KtmNotification  : 0xfffff80e`48689af0     long  +0
   +0x1a0 SectionNotification : (null) 
   +0x1a8 Operations       : 0xffff828a`90581c60 _FLT_OPERATION_REGISTRATION
   +0x1b0 OldDriverUnload  : (null) 
   +0x1b8 ActiveOpens      : _FLT_MUTEX_LIST_HEAD
   +0x208 ConnectionList   : _FLT_MUTEX_LIST_HEAD
   +0x258 PortList         : _FLT_MUTEX_LIST_HEAD
   +0x2a8 PortLock         : _EX_PUSH_LOCK
```

Read the callbacks array until we get the IRP_MJ_END

```
0: kd> dx -id 0,0,ffff9d08f727d380 -r1 ((FLTMGR!_FLT_OPERATION_REGISTRATION *)0xffff9d08fb190b50)
((FLTMGR!_FLT_OPERATION_REGISTRATION *)0xffff9d08fb190b50)                 : 0xffff9d08fb190b50 [Type: _FLT_OPERATION_REGISTRATION *]
    [+0x000] MajorFunction    : 0x0 [Type: unsigned char]
    [+0x004] Flags            : 0x0 [Type: unsigned long]
    [+0x008] PreOperation     : 0xfffff801490912b4 : amsdk+0x112b4 [Type: _FLT_PREOP_CALLBACK_STATUS (__cdecl*)(_FLT_CALLBACK_DATA *,_FLT_RELATED_OBJECTS *,void * *)]
    [+0x010] PostOperation    : 0xfffff801490912fc : amsdk+0x112fc [Type: _FLT_POSTOP_CALLBACK_STATUS (__cdecl*)(_FLT_CALLBACK_DATA *,_FLT_RELATED_OBJECTS *,void *,unsigned long)]
    [+0x018] Reserved1        : 0x0 [Type: void *]
0: kd> dq 0xffff9d08fb190b50
ffff9d08`fb190b50  00000000`00000000 fffff801`490912b4
ffff9d08`fb190b60  fffff801`490912fc 00000000`00000000
ffff9d08`fb190b70  00000000`00000004 fffff801`49091470
ffff9d08`fb190b80  00000000`00000000 00000000`00000000
ffff9d08`fb190b90  00000000`00000080 00000000`00000000
ffff9d08`fb190ba0  00000000`00000000 00000000`00000000
ffff9d08`fb190bb0  00640073`006d0061 00000000`0000006b
ffff9d08`fb190bc0  ff495121`8f162408 00000000`0000000e
```