### FSMF Initialization
#### Links
https://aviadshamriz.medium.com/part-1-fs-minifilter-hooking-7e743b042a9d
https://docs.microsoft.com/en-us/archive/blogs/alexcarp/
https://fsfilters.blogspot.com/2010/02/filter-manager-concepts-part-1.html

#### 1. Fltmgr Registration
```
6: kd> bp FLTMGR!FltpSetCallbacksForInstance
6: kd> g
Breakpoint 0 hit
FLTMGR!FltpSetCallbacksForInstance:
fffff802`bfb9b1b8 48895c2408      mov     qword ptr [rsp+8],rbx
5: kd> k
 # Child-SP          RetAddr               Call Site
00 ffff9282`473725e8 fffff802`bfbd0d2f     FLTMGR!FltpSetCallbacksForInstance
01 ffff9282`473725f0 fffff802`bfbd1e98     FLTMGR!FltpInitInstance+0x3c7
02 ffff9282`473726b0 fffff802`bfbd2165     FLTMGR!FltpCreateInstanceFromName+0x1c4
03 ffff9282`47372790 fffff802`bfbdd4bc     FLTMGR!FltpEnumerateRegistryInstances+0x15d
04 ffff9282`47372830 fffff802`bfbdd39c     FLTMGR!FltpDoVolumeNotificationForNewFilter+0xe0
05 ffff9282`47372890 fffff802`c17b10fa     FLTMGR!FltStartFiltering+0x2c
06 ffff9282`473728e0 fffff802`c17b5020     DemoMinifilter!DriverEntry+0x5a 
07 ffff9282`47372920 fffff801`5d0724dd     DemoMinifilter!GsDriverEntry+0x20 
08 ffff9282`47372950 fffff801`5d07080a     nt!IopLoadDriver+0x4bd
09 ffff9282`47372b30 fffff801`5cac11ea     nt!IopLoadUnloadDriver+0x4a
0a ffff9282`47372b70 fffff801`5ca93bc5     nt!ExpWorkerThread+0x16a
0b ffff9282`47372c10 fffff801`5cbc7a3c     nt!PspSystemThreadStartup+0x55
0c ffff9282`47372c60 00000000`00000000     nt!KiStartSystemThread+0x1c
```

Breaking when loading the driver at FltpSetCallbacksForInstance, we see that RCX = FLT_FILTER for our filter object.

We then see that RDX (arg2) is the UNICODE_STRING for our MF Altitude.

```
6: kd> dt FLTMGR!_FLT_FILTER @rcx
   +0x000 Base             : _FLT_OBJECT
   +0x030 Frame            : (null) 
   +0x038 Name             : _UNICODE_STRING "DemoMinifilter"
   +0x048 DefaultAltitude  : _UNICODE_STRING "25000"
   +0x058 Flags            : 0 (No matching name)
   +0x060 DriverObject     : 0xffff828a`95c4f6b0 _DRIVER_OBJECT
   +0x068 InstanceList     : _FLT_RESOURCE_LIST_HEAD
   +0x0e8 VerifierExtension : (null) 
   +0x0f0 VerifiedFiltersLink : _LIST_ENTRY [ 0x00000000`00000000 - 0x00000000`00000000 ]
   +0x100 FilterUnload     : 0xfffff805`5b161080     long  DemoMinifilter!FsFilterUnload+0
   +0x108 InstanceSetup    : (null) 
   +0x110 InstanceQueryTeardown : (null) 
   +0x118 InstanceTeardownStart : (null) 
   +0x120 InstanceTeardownComplete : (null) 
   +0x128 SupportedContextsListHead : (null) 
   +0x130 SupportedContexts : [7] (null) 
   +0x168 PreVolumeMount   : (null) 
   +0x170 PostVolumeMount  : (null) 
   +0x178 GenerateFileName : (null) 
   +0x180 NormalizeNameComponent : (null) 
   +0x188 NormalizeNameComponentEx : (null) 
   +0x190 NormalizeContextCleanup : (null) 
   +0x198 KtmNotification  : (null) 
   +0x1a0 SectionNotification : (null) 
   +0x1a8 Operations       : 0xffff828a`9589d910 _FLT_OPERATION_REGISTRATION
   +0x1b0 OldDriverUnload  : (null) 
   +0x1b8 ActiveOpens      : _FLT_MUTEX_LIST_HEAD
   +0x208 ConnectionList   : _FLT_MUTEX_LIST_HEAD
   +0x258 PortList         : _FLT_MUTEX_LIST_HEAD
   +0x2a8 PortLock         : _EX_PUSH_LOCK
```

This returns an integer of the frame number.
A call is then made to FltpLinkFilterIntoFrame.

So the "recipe" to find the first element is:
```C
	FLTP_FRAME FilterList = FLTMGR.FltGlobals + 0xc0;
	FilterFrameHead = *(PVOID*)FilterList;
	
	/*
		7: kd> ? poi(FLTMGR!FltGlobals+0xc8)-8
		Evaluate expression: -137943351205856 = ffff828a`8f8d6020
		7: kd> dt FLTMGR!_FLTP_FRAME poi(FLTMGR!FltGlobals+0xc8)-8
		   +0x000 Type             : _FLT_TYPE
		   +0x008 Links            : _LIST_ENTRY [ 0xfffff80e`47afa600 - 0xfffff80e`47afa600 ]
		   +0x018 FrameID          : 0
		   +0x020 AltitudeIntervalLow : _UNICODE_STRING "0"
		   +0x030 AltitudeIntervalHigh : _UNICODE_STRING "409500"
		   +0x040 LargeIrpCtrlStackSize : 0x6 ''
		   +0x041 SmallIrpCtrlStackSize : 0x1 ''
		   +0x048 RegisteredFilters : _FLT_RESOURCE_LIST_HEAD
		   +0x0c8 AttachedVolumes  : _FLT_RESOURCE_LIST_HEAD
		   +0x148 MountingVolumes  : _LIST_ENTRY [ 0xffff828a`8f8d6168 - 0xffff828a`8f8d6168 ]
		   +0x158 AttachedFileSystems : _FLT_MUTEX_LIST_HEAD
		   +0x1a8 ZombiedFltObjectContexts : _FLT_MUTEX_LIST_HEAD
		   +0x1f8 KtmResourceManagerHandle : 0xffffffff`80000280 Void
		   +0x200 KtmResourceManager : 0xffff828a`9057f050 _KRESOURCEMANAGER
		   +0x208 FilterUnloadLock : _ERESOURCE
		   +0x270 DeviceObjectAttachLock : _FAST_MUTEX
		   +0x2a8 Prcb             : 0xffff828a`8f9bd700 _FLT_PRCB
		   +0x2b0 PrcbPoolToFree   : 0xffff828a`8f9bd700 Void
		   +0x2b8 LookasidePoolToFree : 0xffff828a`9057d010 Void
		   +0x2c0 IrpCtrlStackProfiler : _FLTP_IRPCTRL_STACK_PROFILER
		   +0x400 SmallIrpCtrlLookasideList : _NPAGED_LOOKASIDE_LIST
		   +0x480 LargeIrpCtrlLookasideList : _NPAGED_LOOKASIDE_LIST
		   +0x500 ReserveIrpCtrls  : _RESERVE_IRPCTRL
	*/

```

```
7: kd> dt FLTMGR!_FLTP_FRAME poi(FLTMGR!FltGlobals+0xc8)-8
   +0x000 Type             : _FLT_TYPE
   +0x008 Links            : _LIST_ENTRY [ 0xfffff80e`47afa600 - 0xfffff80e`47afa600 ]
   +0x018 FrameID          : 0
   +0x020 AltitudeIntervalLow : _UNICODE_STRING "0"
   +0x030 AltitudeIntervalHigh : _UNICODE_STRING "409500"
   +0x040 LargeIrpCtrlStackSize : 0x6 ''
   +0x041 SmallIrpCtrlStackSize : 0x1 ''
   +0x048 RegisteredFilters : _FLT_RESOURCE_LIST_HEAD
   +0x0c8 AttachedVolumes  : _FLT_RESOURCE_LIST_HEAD
   +0x148 MountingVolumes  : _LIST_ENTRY [ 0xffff828a`8f8d6168 - 0xffff828a`8f8d6168 ]
   +0x158 AttachedFileSystems : _FLT_MUTEX_LIST_HEAD
   +0x1a8 ZombiedFltObjectContexts : _FLT_MUTEX_LIST_HEAD
   +0x1f8 KtmResourceManagerHandle : 0xffffffff`80000280 Void
   +0x200 KtmResourceManager : 0xffff828a`9057f050 _KRESOURCEMANAGER
   +0x208 FilterUnloadLock : _ERESOURCE
   +0x270 DeviceObjectAttachLock : _FAST_MUTEX
   +0x2a8 Prcb             : 0xffff828a`8f9bd700 _FLT_PRCB
   +0x2b0 PrcbPoolToFree   : 0xffff828a`8f9bd700 Void
   +0x2b8 LookasidePoolToFree : 0xffff828a`9057d010 Void
   +0x2c0 IrpCtrlStackProfiler : _FLTP_IRPCTRL_STACK_PROFILER
   +0x400 SmallIrpCtrlLookasideList : _NPAGED_LOOKASIDE_LIST
   +0x480 LargeIrpCtrlLookasideList : _NPAGED_LOOKASIDE_LIST
   +0x500 ReserveIrpCtrls  : _RESERVE_IRPCTRL
7: kd> g
```

!!! I set a breakpoint on FltpSetCallbacksForInstance


```
5: kd> k
 # Child-SP          RetAddr               Call Site
00 ffff9e83`62b345c8 fffff803`55440d2f     FLTMGR!FltpSetCallbacksForInstance
01 ffff9e83`62b345d0 fffff803`55441e98     FLTMGR!FltpInitInstance+0x3c7
02 ffff9e83`62b34690 fffff803`55442165     FLTMGR!FltpCreateInstanceFromName+0x1c4
03 ffff9e83`62b34770 fffff803`5544d5fc     FLTMGR!FltpEnumerateRegistryInstances+0x15d
04 ffff9e83`62b34810 fffff803`5544d4dc     FLTMGR!FltpDoVolumeNotificationForNewFilter+0xe0
05 ffff9e83`62b34870 fffff803`589a116d     FLTMGR!FltStartFiltering+0x2c
06 ffff9e83`62b348c0 fffff803`589a5020     DemoMinifilter!DriverEntry+0x5d [C:\Users\Michael\Desktop\Research\MinifilterStuff\drivers\DemoMinifilter\DemoMinifilter\DemoMinifilter\DemoMinifilter.c @ 58] 
07 ffff9e83`62b34920 fffff803`530c9ca5     DemoMinifilter!GsDriverEntry+0x20 [minkernel\tools\gs_support\kmodefastfail\gs_driverentry.c @ 47] 
08 ffff9e83`62b34950 fffff803`530c936a     nt!IopLoadDriver+0x4bd
09 ffff9e83`62b34b30 fffff803`52b1431a     nt!IopLoadUnloadDriver+0x4a
0a ffff9e83`62b34b70 fffff803`52ae7645     nt!ExpWorkerThread+0x16a
0b ffff9e83`62b34c10 fffff803`52bca82c     nt!PspSystemThreadStartup+0x55
0c ffff9e83`62b34c60 00000000`00000000     nt!KiStartSystemThread+0x1c
```

As it turns out, patching out the callbacks in the volume was what I needed to do.

```
0: kd> !fltkd.filters

Filter List: ffffa40de6ac20d0 "Frame 0" 
   FLT_FILTER: ffffa40de78a09a0 "WdFilter" "328010"
      FLT_INSTANCE: ffffa40de7755b20 "WdFilter Instance" "328010"
      FLT_INSTANCE: ffffa40de768d8a0 "WdFilter Instance" "328010"
      FLT_INSTANCE: ffffa40de7942b20 "WdFilter Instance" "328010"
      FLT_INSTANCE: ffffa40de7d31010 "WdFilter Instance" "328010"
   FLT_FILTER: ffffa40deb7c49e0 "storqosflt" "244000"
   FLT_FILTER: ffffa40deb7359e0 "wcifs" "189900"
      FLT_INSTANCE: ffffa40deb6ae8a0 "wcifs Instance" "189900"
   FLT_FILTER: ffffa40de6b359e0 "CldFlt" "180451"
   FLT_FILTER: ffffa40de76cc8a0 "FileCrypt" "141100"
   FLT_FILTER: ffffa40deb74d010 "luafv" "135000"
      FLT_INSTANCE: ffffa40deb750010 "luafv" "135000"
   FLT_FILTER: ffffa40de791f8a0 "npsvctrig" "46000"
      FLT_INSTANCE: ffffa40de7b068f0 "npsvctrig" "46000"
   FLT_FILTER: ffffa40de7793560 "Wof" "40700"
      FLT_INSTANCE: ffffa40de7753b20 "Wof Instance" "40700"
      FLT_INSTANCE: ffffa40dea1994c0 "Wof Instance" "40700"
   FLT_FILTER: ffffa40de7793010 "FileInfo" "40500"
      FLT_INSTANCE: ffffa40de77518a0 "FileInfo" "40500"
      FLT_INSTANCE: ffffa40de7a5d9a0 "FileInfo" "40500"
      FLT_INSTANCE: ffffa40de74299f0 "FileInfo" "40500"
      FLT_INSTANCE: ffffa40dea238560 "FileInfo" "40500"
   FLT_FILTER: ffffa40debf8f840 "DemoMinifilter" "23456"
      FLT_INSTANCE: ffffa40de7e33cb0 "AltitudeAndFlags" "23456"
      FLT_INSTANCE: ffffa40deec1a270 "AltitudeAndFlags" "23456"
      FLT_INSTANCE: ffffa40debbe9d00 "AltitudeAndFlags" "23456"
      FLT_INSTANCE: ffffa40dec232cb0 "AltitudeAndFlags" "23456"
0: kd> dt FLTMGR!_FLT_FILTER ffffa40debf8f840
   +0x000 Base             : _FLT_OBJECT
   +0x030 Frame            : 0xffffa40d`e6ac2020 _FLTP_FRAME
   +0x038 Name             : _UNICODE_STRING "DemoMinifilter"
   +0x048 DefaultAltitude  : _UNICODE_STRING "23456"
   +0x058 Flags            : 2 ( FLTFL_FILTERING_INITIATED )
   +0x060 DriverObject     : 0xffffa40d`ec1c1060 _DRIVER_OBJECT
   +0x068 InstanceList     : _FLT_RESOURCE_LIST_HEAD
   +0x0e8 VerifierExtension : (null) 
   +0x0f0 VerifiedFiltersLink : _LIST_ENTRY [ 0x00000000`00000000 - 0x00000000`00000000 ]
   +0x100 FilterUnload     : 0xfffff804`2a2f1080     long  DemoMinifilter!FsFilterUnload+0
   +0x108 InstanceSetup    : (null) 
   +0x110 InstanceQueryTeardown : (null) 
   +0x118 InstanceTeardownStart : (null) 
   +0x120 InstanceTeardownComplete : (null) 
   +0x128 SupportedContextsListHead : (null) 
   +0x130 SupportedContexts : [7] (null) 
   +0x168 PreVolumeMount   : (null) 
   +0x170 PostVolumeMount  : (null) 
   +0x178 GenerateFileName : (null) 
   +0x180 NormalizeNameComponent : (null) 
   +0x188 NormalizeNameComponentEx : (null) 
   +0x190 NormalizeContextCleanup : (null) 
   +0x198 KtmNotification  : (null) 
   +0x1a0 SectionNotification : (null) 
   +0x1a8 Operations       : 0xffffa40d`ebf8faf0 _FLT_OPERATION_REGISTRATION
   +0x1b0 OldDriverUnload  : (null) 
   +0x1b8 ActiveOpens      : _FLT_MUTEX_LIST_HEAD
   +0x208 ConnectionList   : _FLT_MUTEX_LIST_HEAD
   +0x258 PortList         : _FLT_MUTEX_LIST_HEAD
   +0x2a8 PortLock         : _EX_PUSH_LOCK
0: kd> dt FLTMGR!_FLTP_FRAME poi(FLTMGR!FltGlobals+0xc8)-8
   +0x000 Type             : _FLT_TYPE
   +0x008 Links            : _LIST_ENTRY [ 0xfffff804`2722a600 - 0xfffff804`2722a600 ]
   +0x018 FrameID          : 0
   +0x020 AltitudeIntervalLow : _UNICODE_STRING "0"
   +0x030 AltitudeIntervalHigh : _UNICODE_STRING "409500"
   +0x040 LargeIrpCtrlStackSize : 0x6 ''
   +0x041 SmallIrpCtrlStackSize : 0x1 ''
   +0x048 RegisteredFilters : _FLT_RESOURCE_LIST_HEAD
   +0x0c8 AttachedVolumes  : _FLT_RESOURCE_LIST_HEAD
   +0x148 MountingVolumes  : _LIST_ENTRY [ 0xffffa40d`e6ac2168 - 0xffffa40d`e6ac2168 ]
   +0x158 AttachedFileSystems : _FLT_MUTEX_LIST_HEAD
   +0x1a8 ZombiedFltObjectContexts : _FLT_MUTEX_LIST_HEAD
   +0x1f8 KtmResourceManagerHandle : 0xffffffff`80000294 Void
   +0x200 KtmResourceManager : 0xffffa40d`e7794990 _KRESOURCEMANAGER
   +0x208 FilterUnloadLock : _ERESOURCE
   +0x270 DeviceObjectAttachLock : _FAST_MUTEX
   +0x2a8 Prcb             : 0xffffa40d`e6ac0700 _FLT_PRCB
   +0x2b0 PrcbPoolToFree   : 0xffffa40d`e6ac06d0 Void
   +0x2b8 LookasidePoolToFree : 0xffffa40d`e7792010 Void
   +0x2c0 IrpCtrlStackProfiler : _FLTP_IRPCTRL_STACK_PROFILER
   +0x400 SmallIrpCtrlLookasideList : _NPAGED_LOOKASIDE_LIST
   +0x480 LargeIrpCtrlLookasideList : _NPAGED_LOOKASIDE_LIST
   +0x500 ReserveIrpCtrls  : _RESERVE_IRPCTRL
0: kd> dx -id 0,0,ffffa40de6a7b200 -r1 (*((FLTMGR!_FLT_RESOURCE_LIST_HEAD *)0xffffa40de6ac20e8))
(*((FLTMGR!_FLT_RESOURCE_LIST_HEAD *)0xffffa40de6ac20e8))                 [Type: _FLT_RESOURCE_LIST_HEAD]
    [+0x000] rLock            : Unowned Resource [Type: _ERESOURCE]
    [+0x068] rList            [Type: _LIST_ENTRY]
    [+0x078] rCount           : 0x6 [Type: unsigned long]
0: kd> dx -id 0,0,ffffa40de6a7b200 -r1 (*((FLTMGR!_LIST_ENTRY *)0xffffa40de6ac2150))
(*((FLTMGR!_LIST_ENTRY *)0xffffa40de6ac2150))                 [Type: _LIST_ENTRY]
    [+0x000] Flink            : 0xffffa40de7a1e6a0 [Type: _LIST_ENTRY *]
    [+0x008] Blink            : 0xffffa40de7d49020 [Type: _LIST_ENTRY *]
0: kd> dt FLTMGR!_FLT_VOLUME
   +0x000 Base             : _FLT_OBJECT
   +0x030 Flags            : _FLT_VOLUME_FLAGS
   +0x034 FileSystemType   : _FLT_FILESYSTEM_TYPE
   +0x038 DeviceObject     : Ptr64 _DEVICE_OBJECT
   +0x040 DiskDeviceObject : Ptr64 _DEVICE_OBJECT
   +0x048 FrameZeroVolume  : Ptr64 _FLT_VOLUME
   +0x050 VolumeInNextFrame : Ptr64 _FLT_VOLUME
   +0x058 Frame            : Ptr64 _FLTP_FRAME
   +0x060 DeviceName       : _UNICODE_STRING
   +0x070 GuidName         : _UNICODE_STRING
   +0x080 CDODeviceName    : _UNICODE_STRING
   +0x090 CDODriverName    : _UNICODE_STRING
   +0x0a0 InstanceList     : _FLT_RESOURCE_LIST_HEAD
   +0x120 Callbacks        : _CALLBACK_CTRL
   +0x508 ContextLock      : _EX_PUSH_LOCK
   +0x510 VolumeContexts   : _CONTEXT_LIST_CTRL
   +0x518 StreamListCtrls  : _FLT_RESOURCE_LIST_HEAD
   +0x598 FileListCtrls    : _FLT_RESOURCE_LIST_HEAD
   +0x618 NameCacheCtrl    : _NAME_CACHE_VOLUME_CTRL
   +0x6d0 MountNotifyLock  : _ERESOURCE
   +0x738 TargetedOpenActiveCount : Int4B
   +0x740 TxVolContextListLock : _EX_PUSH_LOCK
   +0x748 TxVolContexts    : _TREE_ROOT
   +0x750 SupportedFeatures : Int4B
0: kd> dt FLTMGR!_FLT_VOLUME 0xffffa40de7a1e6a0-0x10
   +0x000 Base             : _FLT_OBJECT
   +0x030 Flags            : 0x1e5 (No matching name)
   +0x034 FileSystemType   : d ( FLT_FSTYPE_MUP )
   +0x038 DeviceObject     : 0xffffa40d`e79c1c00 _DEVICE_OBJECT
   +0x040 DiskDeviceObject : (null) 
   +0x048 FrameZeroVolume  : 0xffffa40d`e7a1e690 _FLT_VOLUME
   +0x050 VolumeInNextFrame : (null) 
   +0x058 Frame            : 0xffffa40d`e6ac2020 _FLTP_FRAME
   +0x060 DeviceName       : _UNICODE_STRING "\Device\Mup"
   +0x070 GuidName         : _UNICODE_STRING "???"
   +0x080 CDODeviceName    : _UNICODE_STRING "\Device\Mup"
   +0x090 CDODriverName    : _UNICODE_STRING "\FileSystem\Mup"
   +0x0a0 InstanceList     : _FLT_RESOURCE_LIST_HEAD
   +0x120 Callbacks        : _CALLBACK_CTRL
   +0x508 ContextLock      : _EX_PUSH_LOCK
   +0x510 VolumeContexts   : _CONTEXT_LIST_CTRL
   +0x518 StreamListCtrls  : _FLT_RESOURCE_LIST_HEAD
   +0x598 FileListCtrls    : _FLT_RESOURCE_LIST_HEAD
   +0x618 NameCacheCtrl    : _NAME_CACHE_VOLUME_CTRL
   +0x6d0 MountNotifyLock  : _ERESOURCE
   +0x738 TargetedOpenActiveCount : 0n0
   +0x740 TxVolContextListLock : _EX_PUSH_LOCK
   +0x748 TxVolContexts    : _TREE_ROOT
   +0x750 SupportedFeatures : 0n0
0: kd> dx -id 0,0,ffffa40de6a7b200 -r1 ((FLTMGR!_LIST_ENTRY *)0xffffa40de7a1e6a0)
((FLTMGR!_LIST_ENTRY *)0xffffa40de7a1e6a0)                 : 0xffffa40de7a1e6a0 [Type: _LIST_ENTRY *]
    [+0x000] Flink            : 0xffffa40de7a42020 [Type: _LIST_ENTRY *]
    [+0x008] Blink            : 0xffffa40de6ac2150 [Type: _LIST_ENTRY *]
0: kd> dt FLTMGR!_FLT_VOLUME 0xffffa40de7a42020-0x10
   +0x000 Base             : _FLT_OBJECT
   +0x030 Flags            : 0x164 (No matching name)
   +0x034 FileSystemType   : 2 ( FLT_FSTYPE_NTFS )
   +0x038 DeviceObject     : 0xffffa40d`e76558d0 _DEVICE_OBJECT
   +0x040 DiskDeviceObject : 0xffffa40d`e7746b80 _DEVICE_OBJECT
   +0x048 FrameZeroVolume  : 0xffffa40d`e7a42010 _FLT_VOLUME
   +0x050 VolumeInNextFrame : (null) 
   +0x058 Frame            : 0xffffa40d`e6ac2020 _FLTP_FRAME
   +0x060 DeviceName       : _UNICODE_STRING "\Device\HarddiskVolume4"
   +0x070 GuidName         : _UNICODE_STRING "\??\Volume{039134da-0087-435f-90c9-e0910217e4aa}"
   +0x080 CDODeviceName    : _UNICODE_STRING "\Ntfs"
   +0x090 CDODriverName    : _UNICODE_STRING "\FileSystem\Ntfs"
   +0x0a0 InstanceList     : _FLT_RESOURCE_LIST_HEAD
   +0x120 Callbacks        : _CALLBACK_CTRL
   +0x508 ContextLock      : _EX_PUSH_LOCK
   +0x510 VolumeContexts   : _CONTEXT_LIST_CTRL
   +0x518 StreamListCtrls  : _FLT_RESOURCE_LIST_HEAD
   +0x598 FileListCtrls    : _FLT_RESOURCE_LIST_HEAD
   +0x618 NameCacheCtrl    : _NAME_CACHE_VOLUME_CTRL
   +0x6d0 MountNotifyLock  : _ERESOURCE
   +0x738 TargetedOpenActiveCount : 0n657
   +0x740 TxVolContextListLock : _EX_PUSH_LOCK
   +0x748 TxVolContexts    : _TREE_ROOT
   +0x750 SupportedFeatures : 0n7
0: kd> dx -id 0,0,ffffa40de6a7b200 -r1 (*((FLTMGR!_CALLBACK_CTRL *)0xffffa40de7a42130))
(*((FLTMGR!_CALLBACK_CTRL *)0xffffa40de7a42130))                 [Type: _CALLBACK_CTRL]
    [+0x000] OperationLists   [Type: _LIST_ENTRY [50]]
    [+0x320] OperationFlags   [Type: _CALLBACK_NODE_FLAGS [50]]
0: kd> dx -id 0,0,ffffa40de6a7b200 -r1 (*((FLTMGR!_LIST_ENTRY (*)[50])0xffffa40de7a42130))
(*((FLTMGR!_LIST_ENTRY (*)[50])0xffffa40de7a42130))                 [Type: _LIST_ENTRY [50]]
    [0]              [Type: _LIST_ENTRY]
    [1]              [Type: _LIST_ENTRY]
    [2]              [Type: _LIST_ENTRY]
    [3]              [Type: _LIST_ENTRY]
    [4]              [Type: _LIST_ENTRY]
    [5]              [Type: _LIST_ENTRY]
    [6]              [Type: _LIST_ENTRY]
    [7]              [Type: _LIST_ENTRY]
    [8]              [Type: _LIST_ENTRY]
    [9]              [Type: _LIST_ENTRY]
    [10]             [Type: _LIST_ENTRY]
    [11]             [Type: _LIST_ENTRY]
    [12]             [Type: _LIST_ENTRY]
    [13]             [Type: _LIST_ENTRY]
    [14]             [Type: _LIST_ENTRY]
    [15]             [Type: _LIST_ENTRY]
    [16]             [Type: _LIST_ENTRY]
    [17]             [Type: _LIST_ENTRY]
    [18]             [Type: _LIST_ENTRY]
    [19]             [Type: _LIST_ENTRY]
    [20]             [Type: _LIST_ENTRY]
    [21]             [Type: _LIST_ENTRY]
    [22]             [Type: _LIST_ENTRY]
    [23]             [Type: _LIST_ENTRY]
    [24]             [Type: _LIST_ENTRY]
    [25]             [Type: _LIST_ENTRY]
    [26]             [Type: _LIST_ENTRY]
    [27]             [Type: _LIST_ENTRY]
    [28]             [Type: _LIST_ENTRY]
    [29]             [Type: _LIST_ENTRY]
    [30]             [Type: _LIST_ENTRY]
    [31]             [Type: _LIST_ENTRY]
    [32]             [Type: _LIST_ENTRY]
    [33]             [Type: _LIST_ENTRY]
    [34]             [Type: _LIST_ENTRY]
    [35]             [Type: _LIST_ENTRY]
    [36]             [Type: _LIST_ENTRY]
    [37]             [Type: _LIST_ENTRY]
    [38]             [Type: _LIST_ENTRY]
    [39]             [Type: _LIST_ENTRY]
    [40]             [Type: _LIST_ENTRY]
    [41]             [Type: _LIST_ENTRY]
    [42]             [Type: _LIST_ENTRY]
    [43]             [Type: _LIST_ENTRY]
    [44]             [Type: _LIST_ENTRY]
    [45]             [Type: _LIST_ENTRY]
    [46]             [Type: _LIST_ENTRY]
    [47]             [Type: _LIST_ENTRY]
    [48]             [Type: _LIST_ENTRY]
    [49]             [Type: _LIST_ENTRY]
0: kd> dx -id 0,0,ffffa40de6a7b200 -r1 (*((FLTMGR!_LIST_ENTRY *)0xffffa40de7a42290))
(*((FLTMGR!_LIST_ENTRY *)0xffffa40de7a42290))                 [Type: _LIST_ENTRY]
    [+0x000] Flink            : 0xffffa40de768db00 [Type: _LIST_ENTRY *]
    [+0x008] Blink            : 0xffffa40deec1a4a0 [Type: _LIST_ENTRY *]
0: kd> dl 0xffffa40de768db00
ffffa40d`e768db00  ffffa40d`eb6aead0 ffffa40d`e7a42290
ffffa40d`e768db10  ffffa40d`e768d8a0 fffff804`27f87360
ffffa40d`eb6aead0  ffffa40d`eb7505a0 ffffa40d`e768db00
ffffa40d`eb6aeae0  ffffa40d`eb6ae8a0 fffff804`2a6b19e0
ffffa40d`eb7505a0  ffffa40d`e7753d50 ffffa40d`eb6aead0
ffffa40d`eb7505b0  ffffa40d`eb750010 fffff804`2a67ef40
ffffa40d`e7753d50  ffffa40d`e7a5dbd0 ffffa40d`eb7505a0
ffffa40d`e7753d60  ffffa40d`e7753b20 fffff804`27f3dcf0
ffffa40d`e7a5dbd0  ffffa40d`eec1a4a0 ffffa40d`e7753d50
ffffa40d`e7a5dbe0  ffffa40d`e7a5d9a0 fffff804`27f0f810
ffffa40d`eec1a4a0  ffffa40d`e7a42290 ffffa40d`e7a5dbd0
ffffa40d`eec1a4b0  ffffa40d`eec1a270 fffff804`2a2f1000
ffffa40d`e7a42290  ffffa40d`e768db00 ffffa40d`eec1a4a0
ffffa40d`e7a422a0  ffffa40d`eb7505d0 ffffa40d`eb7505d0
0: kd> x DemoMinifilter!PreCreateCallback
fffff804`2a2f1000 DemoMinifilter!PreCreateCallback (struct _FLT_CALLBACK_DATA *, struct _FLT_RELATED_OBJECTS *, void **)
0: kd> uf nt!KeQueryPriorityThread
nt!KeQueryPriorityThread:
fffff804`24ddfaa0 488d0519ff4200  lea     rax,[nt!KiInitialProcess (fffff804`2520f9c0)]
fffff804`24ddfaa7 48398120020000  cmp     qword ptr [rcx+220h],rax
fffff804`24ddfaae 7408            je      nt!KeQueryPriorityThread+0x18 (fffff804`24ddfab8)  Branch

nt!KeQueryPriorityThread+0x10:
fffff804`24ddfab0 0fbe81c3000000  movsx   eax,byte ptr [rcx+0C3h]
fffff804`24ddfab7 c3              ret

nt!KeQueryPriorityThread+0x18:
fffff804`24ddfab8 b801000000      mov     eax,1
fffff804`24ddfabd c3              ret
0: kd> eq ffffa40d`eec1a4b8 fffff804`24ddfab8
0: kd> dl 0xffffa40de768db00
ffffa40d`e768db00  ffffa40d`eb6aead0 ffffa40d`e7a42290
ffffa40d`e768db10  ffffa40d`e768d8a0 fffff804`27f87360
ffffa40d`eb6aead0  ffffa40d`eb7505a0 ffffa40d`e768db00
ffffa40d`eb6aeae0  ffffa40d`eb6ae8a0 fffff804`2a6b19e0
ffffa40d`eb7505a0  ffffa40d`e7753d50 ffffa40d`eb6aead0
ffffa40d`eb7505b0  ffffa40d`eb750010 fffff804`2a67ef40
ffffa40d`e7753d50  ffffa40d`e7a5dbd0 ffffa40d`eb7505a0
ffffa40d`e7753d60  ffffa40d`e7753b20 fffff804`27f3dcf0
ffffa40d`e7a5dbd0  ffffa40d`eec1a4a0 ffffa40d`e7753d50
ffffa40d`e7a5dbe0  ffffa40d`e7a5d9a0 fffff804`27f0f810
ffffa40d`eec1a4a0  ffffa40d`e7a42290 ffffa40d`e7a5dbd0
ffffa40d`eec1a4b0  ffffa40d`eec1a270 fffff804`24ddfab8
ffffa40d`e7a42290  ffffa40d`e768db00 ffffa40d`eec1a4a0
ffffa40d`e7a422a0  ffffa40d`eb7505d0 ffffa40d`eb7505d0
0: kd> g
```